'''
여행가 A는 N x N 크기의 정사각형 공간 위에 서 있다. 
이 공간은 1 x 1 크기의 정사각형으로 나누어져 있다. 
가장 왼쪽 위 좌표는 (1, 1)이며, 가장 오른쪽 아래 좌표는 (N, N)에 해당함. 
여행가 A는 상, 하, 좌, 우 방향으로 이동할 수 있으며, 시작 좌표는 항상 (1, 1)임. 
우리 앞에는 여행가 A가 이동할 계획이 적힌 계획서가 놓여 있다.

계획서에는 하나의 줄에 띄어쓰기를 기준으로 하여 L, R, U, D 중 하나의 문자가 반복적으로 적혀있다. 
각 문자의 의미는 다음과 같다. 

- L : 왼쪽으로 한 칸 이동
- R : 오른쪽으로 한 칸 이동
- U : 위로 한 칸 이동
- D : 아래로 한 칸 이동

이 경우 6개의 명령에 따라서 여행가가 움직이게 되는 위치는 순서대로 
(1, 2), (1, 3), (1, 4), (1, 4), (2, 4), (3, 4) 이므로, 
최종적으로 여행가 A가 도착하게 되는 곳의 좌표는 (3, 4)이다. 
다시 말해 3행 4열의 위치에 해당하므로 (3, 4)라고 적는다. 

계획서가 주어졌을 때 여행가 A가 최종적으로 도착할 지점의 좌표를 출력하는 프로그램을 작성하시오.
'''



'''
회고 / TIL

'''